{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\agrogan\Box Sync\Box Sync\GitHub\multilevel\logistic-interactions\logistic-interactions.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}10 Mar 2020, 13:53:49
{txt}
{com}. //_1
. display c(current_date)
{res}10 Mar 2020
{txt}
{com}. //_2
. display c(current_time)
{res}13:53:49
{txt}
{com}. //_3
. clear all // empty data
{res}{txt}
{com}. //_4
. set obs 10000 // set observations
{txt}{p}
number of observations (_N)  was 0,
now 10,000
{p_end}

{com}. //_5
. generate x1 = rnormal(0, 2) // normally distributed
{txt}
{com}. //_6
. generate x2 = rbinomial(1, .5) // categorical variable
{txt}
{com}. //_7
. summarize // descriptive statistics

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}x1 {c |}{res}     10,000    .0001408    1.991975  -7.634315   7.043506
{txt}{space 10}x2 {c |}{res}     10,000        .493     .499976          0          1
{txt}
{com}. //_8
. generate zA = x1 + x2 // first z
{txt}
{com}. //_9
. generate pA = exp(zA) / (1 + exp(zA)) // probabilities
{txt}
{com}. //_10
. summarize pA // descriptive statistics

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}pA {c |}{res}     10,000    .5741862    .3129822   .0008352   .9996789
{txt}
{com}. //_11
. generate yA = rbinomial(1, pA) // generate y with probability p
{txt}
{com}. //_12
. tab yA // descriptive statistics

         {txt}yA {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,237       42.37       42.37
{txt}          1 {c |}{res}      5,763       57.63      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,000      100.00
{txt}
{com}. //_13
. logit yA x1 x2 // does it recover the parameters?

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-6814.5818}  
Iteration 1:{space 3}log likelihood = {res:-4484.6166}  
Iteration 2:{space 3}log likelihood = {res:-4433.6528}  
Iteration 3:{space 3}log likelihood = {res:-4432.9688}  
Iteration 4:{space 3}log likelihood = {res:-4432.9686}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}    10,000
{txt}{col 49}LR chi2({res}2{txt}){col 67}= {res}   4763.23
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-4432.9686{txt}{col 49}Pseudo R2{col 67}= {res}    0.3495

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          yA{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}x1 {c |}{col 14}{res}{space 2}  1.02339{col 26}{space 2} .0211541{col 37}{space 1}   48.38{col 46}{space 3}0.000{col 54}{space 4} .9819283{col 67}{space 3} 1.064851
{txt}{space 10}x2 {c |}{col 14}{res}{space 2} .9979633{col 26}{space 2} .0539552{col 37}{space 1}   18.50{col 46}{space 3}0.000{col 54}{space 4}  .892213{col 67}{space 3} 1.103714
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0220674{col 26}{space 2} .0364477{col 37}{space 1}    0.61{col 46}{space 3}0.545{col 54}{space 4}-.0493687{col 67}{space 3} .0935036
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_14
. predict yhatA // predicted probabilities
{txt}(option {bf:pr} assumed; Pr(yA))

{com}. //_15
. generate zB = x1 + x2 + (.75 * x1 * x2) // second z
{txt}
{com}. //_16
. generate pB = exp(zB) / (1 + exp(zB)) // probabilities
{txt}
{com}. //_17
. summarize pB // descriptive statistics

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}pB {c |}{res}     10,000    .5517331    .3477357   4.29e-06   .9999984
{txt}
{com}. //_18
. generate yB = rbinomial(1, pB) // generate y with probability p
{txt}
{com}. //_19
. tab yB // descriptive statistics

         {txt}yB {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,529       45.29       45.29
{txt}          1 {c |}{res}      5,471       54.71      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,000      100.00
{txt}
{com}. //_20
. logit yB c.x1##i.x2 // does it recover the parameters?

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-6887.0378}  
Iteration 1:{space 3}log likelihood = {res:-4019.1014}  
Iteration 2:{space 3}log likelihood = {res:-3938.4941}  
Iteration 3:{space 3}log likelihood = {res:-3934.2638}  
Iteration 4:{space 3}log likelihood = {res:-3934.2528}  
Iteration 5:{space 3}log likelihood = {res:-3934.2528}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}    10,000
{txt}{col 49}LR chi2({res}3{txt}){col 67}= {res}   5905.57
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-3934.2528{txt}{col 49}Pseudo R2{col 67}= {res}    0.4287

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          yB{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}x1 {c |}{col 14}{res}{space 2} .9756118{col 26}{space 2} .0279305{col 37}{space 1}   34.93{col 46}{space 3}0.000{col 54}{space 4} .9208691{col 67}{space 3} 1.030355
{txt}{space 8}1.x2 {c |}{col 14}{res}{space 2} 1.001694{col 26}{space 2} .0614978{col 37}{space 1}   16.29{col 46}{space 3}0.000{col 54}{space 4} .8811604{col 67}{space 3} 1.122227
{txt}{space 12} {c |}
{space 5}x2#c.x1 {c |}
{space 10}1  {c |}{col 14}{res}{space 2}  .798564{col 26}{space 2} .0592743{col 37}{space 1}   13.47{col 46}{space 3}0.000{col 54}{space 4} .6823885{col 67}{space 3} .9147396
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0330953{col 26}{space 2}  .035931{col 37}{space 1}   -0.92{col 46}{space 3}0.357{col 54}{space 4}-.1035187{col 67}{space 3} .0373282
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_21
. predict yhatB // predicted probabilities
{txt}(option {bf:pr} assumed; Pr(yB))

{com}. //_22
. twoway ///
> (scatter yB x1 if x2 == 0, msize(tiny)) /// points
> (scatter yB x1 if x2 == 1, msize(tiny)) /// points
> (scatter yhatB x1 if x2 == 0, msize(tiny)) ///
> (scatter yhatB x1 if x2 == 1, msize(tiny)), ///
> title("Logit Curves for 2 Groups") ///
> scheme(michigan)
{res}{txt}
{com}. //_23
. quietly graph export mygraph.png, width(500) replace
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\agrogan\Box Sync\Box Sync\GitHub\multilevel\logistic-interactions\logistic-interactions.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}10 Mar 2020, 13:53:52
{txt}{.-}
{smcl}
{txt}{sf}{ul off}