{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Box Sync/GitHub/multilevel/logistic-interactions/logistic-interactions.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}20 Mar 2020, 08:22:43
{txt}
{com}. //_1
. display c(current_date)
{res}20 Mar 2020
{txt}
{com}. //_2
. display c(current_time)
{res}08:22:43
{txt}
{com}. //_3
. clear all // empty data
{res}{txt}
{com}. //_4
. set obs 10000 // set observations
{txt}{p}
number of observations (_N)  was 0,
now 10,000
{p_end}

{com}. //_5
. generate x1 = rnormal(0, 2) // normally distributed
{txt}
{com}. //_6
. histogram x1, scheme(michigan)
{txt}(bin={res}40{txt}, start={res}-8.316865{txt}, width={res}.39425235{txt})
{res}{txt}
{com}. //_7
. graph export myx1graph.png, width(200) replace
{txt}(file myx1graph.png written in PNG format)

{com}. //_8
. generate x2 = rbinomial(1, .5) // categorical variable
{txt}
{com}. //_9
. graph bar, over(x2) scheme(michigan)
{res}{txt}
{com}. //_10
. graph export myx2graph.png, width(200) replace
{txt}(file myx2graph.png written in PNG format)

{com}. //_11
. summarize // descriptive statistics

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}x1 {c |}{res}     10,000    .0126806     1.99713  -8.316865   7.453229
{txt}{space 10}x2 {c |}{res}     10,000       .4914     .499951          0          1
{txt}
{com}. //_12
. generate zA = x1 + x2 // first z
{txt}
{com}. //_13
. generate pA = exp(zA) / (1 + exp(zA)) // probabilities
{txt}
{com}. //_14
. summarize pA // descriptive statistics

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}pA {c |}{res}     10,000    .5742931     .312551   .0002443   .9997869
{txt}
{com}. //_15
. generate yA = rbinomial(1, pA) // generate y with probability p
{txt}
{com}. //_16
. tab yA // descriptive statistics

         {txt}yA {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,288       42.88       42.88
{txt}          1 {c |}{res}      5,712       57.12      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,000      100.00
{txt}
{com}. //_17
. logit yA x1 x2 // does it recover the parameters?

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-6829.7375}  
Iteration 1:{space 3}log likelihood = {res:-4519.9834}  
Iteration 2:{space 3}log likelihood = {res:-4468.6743}  
Iteration 3:{space 3}log likelihood = {res:-4467.9269}  
Iteration 4:{space 3}log likelihood = {res:-4467.9267}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}    10,000
{txt}{col 49}LR chi2({res}2{txt}){col 67}= {res}   4723.62
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-4467.9267{txt}{col 49}Pseudo R2{col 67}= {res}    0.3458

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          yA{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}x1 {c |}{col 14}{res}{space 2} 1.011516{col 26}{space 2} .0208294{col 37}{space 1}   48.56{col 46}{space 3}0.000{col 54}{space 4} .9706917{col 67}{space 3} 1.052341
{txt}{space 10}x2 {c |}{col 14}{res}{space 2} 1.055538{col 26}{space 2} .0542218{col 37}{space 1}   19.47{col 46}{space 3}0.000{col 54}{space 4} .9492649{col 67}{space 3} 1.161811
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0442423{col 26}{space 2} .0360868{col 37}{space 1}   -1.23{col 46}{space 3}0.220{col 54}{space 4}-.1149711{col 67}{space 3} .0264865
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_18
. predict yhatA // predicted probabilities
{txt}(option {bf:pr} assumed; Pr(yA))

{com}. //_19
. generate zB = x1 + x2 + (.75 * x1 * x2) // second z
{txt}
{com}. //_20
. generate pB = exp(zB) / (1 + exp(zB)) // probabilities
{txt}
{com}. //_21
. summarize pB // descriptive statistics

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}pB {c |}{res}     10,000    .5505714    .3483016   3.34e-06   .9999992
{txt}
{com}. //_22
. generate yB = rbinomial(1, pB) // generate y with probability p
{txt}
{com}. //_23
. tab yB // descriptive statistics

         {txt}yB {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,459       44.59       44.59
{txt}          1 {c |}{res}      5,541       55.41      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,000      100.00
{txt}
{com}. //_24
. logit yB c.x1##i.x2 // does it recover the parameters?

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-6872.8209}  
Iteration 1:{space 3}log likelihood = {res:-3954.8434}  
Iteration 2:{space 3}log likelihood = {res:-3867.5072}  
Iteration 3:{space 3}log likelihood = {res:  -3863.05}  
Iteration 4:{space 3}log likelihood = {res:-3863.0356}  
Iteration 5:{space 3}log likelihood = {res:-3863.0356}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}    10,000
{txt}{col 49}LR chi2({res}3{txt}){col 67}= {res}   6019.57
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-3863.0356{txt}{col 49}Pseudo R2{col 67}= {res}    0.4379

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          yB{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}x1 {c |}{col 14}{res}{space 2}  1.01595{col 26}{space 2} .0289157{col 37}{space 1}   35.13{col 46}{space 3}0.000{col 54}{space 4} .9592759{col 67}{space 3} 1.072623
{txt}{space 8}1.x2 {c |}{col 14}{res}{space 2}  1.00315{col 26}{space 2}  .063427{col 37}{space 1}   15.82{col 46}{space 3}0.000{col 54}{space 4} .8788351{col 67}{space 3} 1.127464
{txt}{space 12} {c |}
{space 5}x2#c.x1 {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .7652222{col 26}{space 2} .0600379{col 37}{space 1}   12.75{col 46}{space 3}0.000{col 54}{space 4} .6475501{col 67}{space 3} .8828943
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0325715{col 26}{space 2} .0361302{col 37}{space 1}    0.90{col 46}{space 3}0.367{col 54}{space 4}-.0382424{col 67}{space 3} .1033853
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_25
. predict yhatB // predicted probabilities
{txt}(option {bf:pr} assumed; Pr(yB))

{com}. //_26
. twoway ///
> (scatter yB x1 if x2 == 0, msize(tiny)) /// points
> (scatter yB x1 if x2 == 1, msize(tiny)) /// points
> (scatter yhatB x1 if x2 == 0, msize(tiny)) ///
> (scatter yhatB x1 if x2 == 1, msize(tiny)), ///
> title("Logit Curves for 2 Groups") ///
> scheme(michigan)
{res}{txt}
{com}. //_27
. graph export mygraph.png, width(500) replace
{txt}(file mygraph.png written in PNG format)

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Box Sync/GitHub/multilevel/logistic-interactions/logistic-interactions.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}20 Mar 2020, 08:22:49
{txt}{.-}
{smcl}
{txt}{sf}{ul off}