{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Box Sync/GitHub/multilevel/logistic-interactions/logistic-interactions.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}25 Mar 2020, 16:27:12
{txt}
{com}. //_1
. display c(current_date)
{res}25 Mar 2020
{txt}
{com}. //_2
. display c(current_time)
{res}16:27:12
{txt}
{com}. //_3
. clear all // empty data
{res}{txt}
{com}. //_4
. set obs 10000 // set observations
{txt}{p}
number of observations (_N)  was 0,
now 10,000
{p_end}

{com}. //_5
. generate x1 = rnormal(0, 2) // normally distributed
{txt}
{com}. //_6
. histogram x1, scheme(michigan)
{txt}(bin={res}40{txt}, start={res}-7.6521349{txt}, width={res}.41272972{txt})
{res}{txt}
{com}. //_7
. graph export myx1graph.png, width(200) replace
{txt}(file myx1graph.png written in PNG format)

{com}. //_8
. generate x2 = rbinomial(1, .5) // categorical variable
{txt}
{com}. //_9
. graph bar, over(x2) scheme(michigan)
{res}{txt}
{com}. //_10
. graph export myx2graph.png, width(200) replace
{txt}(file myx2graph.png written in PNG format)

{com}. //_11
. summarize // descriptive statistics

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}x1 {c |}{res}     10,000   -.0290809    1.982619  -7.652135   8.857054
{txt}{space 10}x2 {c |}{res}     10,000       .5011    .5000238          0          1
{txt}
{com}. //_12
. generate zA = x1 + x2 // first z
{txt}
{com}. //_13
. generate pA = exp(zA) / (1 + exp(zA)) // probabilities
{txt}
{com}. //_14
. summarize pA // descriptive statistics

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}pA {c |}{res}     10,000     .570506     .313263   .0004748   .9999476
{txt}
{com}. //_15
. generate yA = rbinomial(1, pA) // generate y with probability p
{txt}
{com}. //_16
. tab yA // descriptive statistics

         {txt}yA {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,327       43.27       43.27
{txt}          1 {c |}{res}      5,673       56.73      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,000      100.00
{txt}
{com}. //_17
. logit yA x1 x2 // does it recover the parameters?

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-6840.6105}  
Iteration 1:{space 3}log likelihood = {res:-4543.7709}  
Iteration 2:{space 3}log likelihood = {res:-4495.6702}  
Iteration 3:{space 3}log likelihood = {res:-4494.8694}  
Iteration 4:{space 3}log likelihood = {res:-4494.8692}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}    10,000
{txt}{col 49}LR chi2({res}2{txt}){col 67}= {res}   4691.48
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-4494.8692{txt}{col 49}Pseudo R2{col 67}= {res}    0.3429

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          yA{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}x1 {c |}{col 14}{res}{space 2} 1.006231{col 26}{space 2} .0206865{col 37}{space 1}   48.64{col 46}{space 3}0.000{col 54}{space 4} .9656864{col 67}{space 3} 1.046776
{txt}{space 10}x2 {c |}{col 14}{res}{space 2}  .978571{col 26}{space 2} .0537042{col 37}{space 1}   18.22{col 46}{space 3}0.000{col 54}{space 4} .8733126{col 67}{space 3} 1.083829
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0096955{col 26}{space 2} .0363177{col 37}{space 1}   -0.27{col 46}{space 3}0.789{col 54}{space 4}-.0808769{col 67}{space 3} .0614859
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_18
. predict yhatA // predicted probabilities
{txt}(option {bf:pr} assumed; Pr(yA))

{com}. //_19
. generate zB = x1 + x2 + (.75 * x1 * x2) // second z
{txt}
{com}. //_20
. generate pB = exp(zB) / (1 + exp(zB)) // probabilities
{txt}
{com}. //_21
. summarize pB // descriptive statistics

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}pB {c |}{res}     10,000    .5464316    .3496357   7.88e-06   .9999999
{txt}
{com}. //_22
. generate yB = rbinomial(1, pB) // generate y with probability p
{txt}
{com}. //_23
. tab yB // descriptive statistics

         {txt}yB {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,568       45.68       45.68
{txt}          1 {c |}{res}      5,432       54.32      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,000      100.00
{txt}
{com}. //_24
. logit yB c.x1##i.x2 // does it recover the parameters?

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-6894.1004}  
Iteration 1:{space 3}log likelihood = {res:-3982.6146}  
Iteration 2:{space 3}log likelihood = {res:-3912.0868}  
Iteration 3:{space 3}log likelihood = {res: -3908.866}  
Iteration 4:{space 3}log likelihood = {res:-3908.8595}  
Iteration 5:{space 3}log likelihood = {res:-3908.8595}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}    10,000
{txt}{col 49}LR chi2({res}3{txt}){col 67}= {res}   5970.48
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-3908.8595{txt}{col 49}Pseudo R2{col 67}= {res}    0.4330

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          yB{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}x1 {c |}{col 14}{res}{space 2} .9960435{col 26}{space 2} .0287374{col 37}{space 1}   34.66{col 46}{space 3}0.000{col 54}{space 4} .9397193{col 67}{space 3} 1.052368
{txt}{space 8}1.x2 {c |}{col 14}{res}{space 2} .9928199{col 26}{space 2}  .061885{col 37}{space 1}   16.04{col 46}{space 3}0.000{col 54}{space 4} .8715275{col 67}{space 3} 1.114112
{txt}{space 12} {c |}
{space 5}x2#c.x1 {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .7398848{col 26}{space 2} .0579223{col 37}{space 1}   12.77{col 46}{space 3}0.000{col 54}{space 4} .6263593{col 67}{space 3} .8534103
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} -.025353{col 26}{space 2} .0362111{col 37}{space 1}   -0.70{col 46}{space 3}0.484{col 54}{space 4}-.0963254{col 67}{space 3} .0456194
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_25
. predict yhatB // predicted probabilities
{txt}(option {bf:pr} assumed; Pr(yB))

{com}. //_26
. twoway ///
> (scatter yB x1 if x2 == 0, msize(tiny)) /// points
> (scatter yB x1 if x2 == 1, msize(tiny)) /// points
> (scatter yhatB x1 if x2 == 0, msize(tiny)) ///
> (scatter yhatB x1 if x2 == 1, msize(tiny)), ///
> xline(0 2) ///
> title("Logit Curves for 2 Groups") ///
> sub("Model With Interaction") ///
> scheme(michigan)
{res}{txt}
{com}. //_27
. graph export mygraph.png, width(500) replace
{txt}(file mygraph.png written in PNG format)

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Box Sync/GitHub/multilevel/logistic-interactions/logistic-interactions.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}25 Mar 2020, 16:27:24
{txt}{.-}
{smcl}
{txt}{sf}{ul off}