{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/multilevel/centering-in-cross-sectional-data/centering-in-cross-sectional-data.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}14 Jan 2026, 11:47:46
{txt}
{com}. //_1
. display c(current_date)
{res}14 Jan 2026
{txt}
{com}. //_2
. display c(current_time)
{res}11:47:46
{txt}
{com}. //_3
. clear all
{res}{txt}
{com}. //_4
. set obs 100
{txt}{p}
Number of observations ({bf:_N}) was 0,
now 100.
{p_end}

{com}. //_5
. generate income = runiform(10000, 70000)
{txt}
{com}. //_6
. generate physical_punishment = rbinomial(1,.3)
{txt}
{com}. //_7
. generate country = int(_n/10) + 1
{txt}
{com}. //_8
. generate e = rnormal(0,1) // individual error
{txt}
{com}. //_9
. generate u = country - 5 // random intercept
{txt}
{com}. //_10
. generate behavior_problems = 110 + -.0001 * income + 10 * physical_punishment + u + e // plausible regression relationship
{txt}
{com}. //_11
. drop e u // drop error terms
{txt}
{com}. //_12
. list in 1/10, table // list out some data
{txt}
     {c TLC}{hline 10}{c -}{hline 10}{c -}{hline 9}{c -}{hline 10}{c TRC}
     {c |} {res}  income   physic~t   country   behavi~s {txt}{c |}
     {c LT}{hline 10}{c -}{hline 10}{c -}{hline 9}{c -}{hline 10}{c RT}
  1. {c |} {res}20148.49          0         1   103.3466 {txt}{c |}
  2. {c |} {res}18292.35          0         1   105.1445 {txt}{c |}
  3. {c |} {res}20029.46          0         1   104.3675 {txt}{c |}
  4. {c |} {res}49927.27          0         1   103.4318 {txt}{c |}
  5. {c |} {res}34768.54          0         1   102.9267 {txt}{c |}
     {c LT}{hline 10}{c -}{hline 10}{c -}{hline 9}{c -}{hline 10}{c RT}
  6. {c |} {res}47199.07          0         1   101.1913 {txt}{c |}
  7. {c |} {res}44796.36          1         1   111.0747 {txt}{c |}
  8. {c |} {res}50592.45          0         1   99.76586 {txt}{c |}
  9. {c |} {res}37461.37          0         1   101.8378 {txt}{c |}
 10. {c |} {res}55994.71          1         2   111.1749 {txt}{c |}
     {c BLC}{hline 10}{c -}{hline 10}{c -}{hline 9}{c -}{hline 10}{c BRC}

{com}. //_13
. twoway (scatter behavior_problems income if physical_punishment ==0) ///
> (scatter behavior_problems income if physical_punishment == 1), ///
> legend(order(1 "no physical punishment" 2 "physical punishment") pos(6)) ///
> title("Behavior Problems by Income and Physical Punishment") ///
> xtitle("Per Capita Income") ///
> ytitle("Behavior Problems") ///
> scheme(michigan)
{res}{txt}
{com}. //_14
. graph export myscatter.png, width(1000) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/multilevel/centering-in-cross-sectional-data/myscatter.png{rm}
saved as
PNG
format
{p_end}

{com}. //_15
. mixed behavior_problems income physical_punishment || country:
{res}
{txt}Performing EM optimization ...
{res}
{txt}Performing gradient-based optimization: 
{res}{txt}Iteration 0:{space 2}Log likelihood = {res:-157.07646}  
Iteration 1:{space 2}Log likelihood = {res:-157.07646}  
{res}
{txt}Computing standard errors ...
{res}
{txt}Mixed-effects ML regression{col 53}Number of obs{col 69} = {res}    100
{txt}Group variable: {res}country{col 53}{txt}Number of groups{col 69} = {res}     11
{txt}{col 53}Obs per group:
{col 66}min = {res}      1
{txt}{col 66}avg = {res}    9.1
{txt}{col 66}max = {res}     10
{col 53}{txt}Wald chi2({res}2{txt}){col 69} = {res}2230.63
{txt}Log likelihood = {res}-157.07646{col 53}{txt}Prob > chi2{col 69} = {res} 0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}behavior_p~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}income {c |}{col 14}{res}{space 2}-.0001021{col 26}{space 2} 5.25e-06{col 37}{space 1}  -19.44{col 46}{space 3}0.000{col 54}{space 4}-.0001124{col 67}{space 3}-.0000918
{txt}physical_p~t {c |}{col 14}{res}{space 2} 9.859842{col 26}{space 2} .2315382{col 37}{space 1}   42.58{col 46}{space 3}0.000{col 54}{space 4} 9.406036{col 67}{space 3} 10.31365
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 110.9004{col 26}{space 2} .9343151{col 37}{space 1}  118.70{col 46}{space 3}0.000{col 54}{space 4} 109.0691{col 67}{space 3} 112.7316
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}{hline 29}{c TT}{hline 48}
{col 3}Random-effects parameters{col 30}{c |}{col 34}Estimate{col 45}Std. err.{col 59}[95% conf. interval]
{hline 29}{c +}{hline 48}
{res}country{txt}: Identity{col 30}{c |}
{space 18}var(_cons) {c |}{res}{col 33} 8.878869{col 44} 3.878162{col 58} 3.771943{col 70} 20.90019
{txt}{hline 29}{c +}{hline 48}
{col 16}var(Residual){col 30}{c |}{res}{col 33} .8283655{col 44} .1242951{col 58} .6173058{col 70} 1.111587
{txt}{hline 29}{c BT}{hline 48}
LR test vs. linear model:{col 27}{help j_chibar##|_new:chibar2(01) =} {res}183.09{col 55}{txt}Prob >= chibar2 = {col 73}{res}0.0000
{txt}
{com}. //_16
. display %5.3f 10000 * _b[income]
{res}-1.021
{txt}
{com}. //_17
. display %5.3f _b[physical_punishment]
{res}9.860
{txt}
{com}. //_18
. display %5.3f _b[_cons]
{res}110.900
{txt}
{com}. //_19
. egen m_income = mean(income) // grand mean of income
{txt}
{com}. //_20
. generate c_income = income - m_income // grand mean centered income
{txt}
{com}. //_21
. twoway (scatter behavior_problems c_income if physical_punishment ==0) ///
> (scatter behavior_problems c_income if physical_punishment == 1), ///
> legend(order(1 "no physical punishment" 2 "physical punishment") pos(6)) ///
> title("Behavior Problems by Income and Physical Punishment") ///
> caption("Income is Grand Mean Centered") ///
> xtitle("Per Capita Income") ///
> ytitle("Behavior Problems") ///
> scheme(michigan)
{res}{txt}
{com}. //_22
. graph export myscatter2.png, width(1000) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/multilevel/centering-in-cross-sectional-data/myscatter2.png{rm}
saved as
PNG
format
{p_end}

{com}. //_23
. mixed behavior_problems c_income physical_punishment || country:
{res}
{txt}Performing EM optimization ...
{res}
{txt}Performing gradient-based optimization: 
{res}{txt}Iteration 0:{space 2}Log likelihood = {res:-157.07646}  
Iteration 1:{space 2}Log likelihood = {res:-157.07646}  
{res}
{txt}Computing standard errors ...
{res}
{txt}Mixed-effects ML regression{col 53}Number of obs{col 69} = {res}    100
{txt}Group variable: {res}country{col 53}{txt}Number of groups{col 69} = {res}     11
{txt}{col 53}Obs per group:
{col 66}min = {res}      1
{txt}{col 66}avg = {res}    9.1
{txt}{col 66}max = {res}     10
{col 53}{txt}Wald chi2({res}2{txt}){col 69} = {res}2230.63
{txt}Log likelihood = {res}-157.07646{col 53}{txt}Prob > chi2{col 69} = {res} 0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}behavior_p~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}c_income {c |}{col 14}{res}{space 2}-.0001021{col 26}{space 2} 5.25e-06{col 37}{space 1}  -19.44{col 46}{space 3}0.000{col 54}{space 4}-.0001124{col 67}{space 3}-.0000918
{txt}physical_p~t {c |}{col 14}{res}{space 2} 9.859842{col 26}{space 2} .2315382{col 37}{space 1}   42.58{col 46}{space 3}0.000{col 54}{space 4} 9.406036{col 67}{space 3} 10.31365
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 106.7117{col 26}{space 2} .9085729{col 37}{space 1}  117.45{col 46}{space 3}0.000{col 54}{space 4}  104.931{col 67}{space 3} 108.4925
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}{hline 29}{c TT}{hline 48}
{col 3}Random-effects parameters{col 30}{c |}{col 34}Estimate{col 45}Std. err.{col 59}[95% conf. interval]
{hline 29}{c +}{hline 48}
{res}country{txt}: Identity{col 30}{c |}
{space 18}var(_cons) {c |}{res}{col 33} 8.878869{col 44} 3.878162{col 58} 3.771942{col 70} 20.90019
{txt}{hline 29}{c +}{hline 48}
{col 16}var(Residual){col 30}{c |}{res}{col 33} .8283655{col 44} .1242951{col 58} .6173058{col 70} 1.111588
{txt}{hline 29}{c BT}{hline 48}
LR test vs. linear model:{col 27}{help j_chibar##|_new:chibar2(01) =} {res}183.09{col 55}{txt}Prob >= chibar2 = {col 73}{res}0.0000
{txt}
{com}. //_24
. bysort country: egen m_g_income = mean(income) // GROUP mean of income
{txt}
{com}. //_25
. generate c_g_income = income - m_g_income // GROUP mean centered income
{txt}
{com}. //_26
. bysort country: egen m_g_physical_punishment = mean(physical_punishment) // GROUP mean of physical punishment
{txt}
{com}. //_27
. generate c_g_physical_punishment = physical_punishment - m_g_physical_punishment // GROUP mean centered physical punishment
{txt}
{com}. //_28
. quietly: mixed behavior_problems income m_g_income physical_punishment m_g_physical_punishment || country:
{txt}
{com}. //_29
. quietly: mixed behavior_problems c_g_physical_punishment m_g_income c_g_physical_punishment m_g_physical_punishment || country:
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/multilevel/centering-in-cross-sectional-data/centering-in-cross-sectional-data.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}14 Jan 2026, 11:47:48
{txt}{.-}
{smcl}
{txt}{sf}{ul off}