{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\agrogan\Box Sync\Box Sync\GitHub\multilevel\centering-in-cross-sectional-data\centering-in-cross-sectional-data.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}25 May 2021, 14:54:52
{txt}
{com}. //_1
. display c(current_date)
{res}25 May 2021
{txt}
{com}. //_2
. display c(current_time)
{res}14:54:52
{txt}
{com}. //_3
. clear all
{res}{txt}
{com}. //_4
. set obs 100
{txt}{p}
Number of observations ({bf:_N}) was 0,
now 100.
{p_end}

{com}. //_5
. generate income = runiform(10000, 70000)
{txt}
{com}. //_6
. generate physical_punishment = rbinomial(1,.3)
{txt}
{com}. //_7
. generate country = int(_n/10) + 1
{txt}
{com}. //_8
. generate e = rnormal(0,1) // individual error
{txt}
{com}. //_9
. generate u = country - 5 // random intercept
{txt}
{com}. //_10
. generate behavior_problems = 110 + -.0001 * income + 10 * physical_punishment + u + e // plausible regression relationship
{txt}
{com}. //_11
. list in 1/10, abb(20) // list out some data
{txt}
     {c TLC}{hline 10}{c -}{hline 21}{c -}{hline 9}{c -}{hline 11}{c -}{hline 4}{c -}{hline 19}{c TRC}
     {c |} {res}  income   physical_punishment   country           e    u   behavior_problems {txt}{c |}
     {c LT}{hline 10}{c -}{hline 21}{c -}{hline 9}{c -}{hline 11}{c -}{hline 4}{c -}{hline 19}{c RT}
  1. {c |} {res}19044.56                     0         1    .4024389   -4             104.498 {txt}{c |}
  2. {c |} {res}11784.18                     0         1   -.7492127   -4            104.0724 {txt}{c |}
  3. {c |} {res}54456.47                     0         1    1.950699   -4            102.5051 {txt}{c |}
  4. {c |} {res}10323.12                     0         1   -.2365216   -4            104.7312 {txt}{c |}
  5. {c |} {res}31238.75                     0         1    .5317396   -4            103.4079 {txt}{c |}
     {c LT}{hline 10}{c -}{hline 21}{c -}{hline 9}{c -}{hline 11}{c -}{hline 4}{c -}{hline 19}{c RT}
  6. {c |} {res}25779.69                     1         1    .3833449   -4            113.8054 {txt}{c |}
  7. {c |} {res}46237.15                     1         1   -1.336349   -4            110.0399 {txt}{c |}
  8. {c |} {res}22314.24                     1         1   -.1576294   -4            113.6109 {txt}{c |}
  9. {c |} {res}24329.21                     1         1   -1.299845   -4            112.2672 {txt}{c |}
 10. {c |} {res}35722.85                     0         2   -.0299588   -3            103.3978 {txt}{c |}
     {c BLC}{hline 10}{c -}{hline 21}{c -}{hline 9}{c -}{hline 11}{c -}{hline 4}{c -}{hline 19}{c BRC}

{com}. //_12
. twoway (scatter behavior_problems income if physical_punishment ==0) ///
> (scatter behavior_problems income if physical_punishment == 1), ///
> legend(order(1 "no physical punishment" 2 "physical punishment") pos(6)) ///
> title("Behavior Problems by Income and Physical Punishment") ///
> xtitle("Per Capita Income") ///
> ytitle("Behavior Problems") ///
> scheme(michigan)
{res}{txt}
{com}. //_13
. graph export myscatter.png, width(1000) replace
{txt}{p 0 4 2}
file {bf}
myscatter.png{rm}
saved as
PNG
format
{p_end}

{com}. //_14
. mixed behavior_problems income physical_punishment || country:
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-165.77618}  
{res}{txt}Iteration 1:{space 3}log likelihood = {res:-165.77618}  
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects ML regression{col 49}Number of obs{col 67}={col 69}{res}       100
{txt}Group variable: {res}country{col 49}{txt}Number of groups{col 67}={col 69}{res}        11
{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       9.1
{txt}{col 63}max{col 67}={col 69}{res}        10
{col 49}{txt}Wald chi2({res}2{txt}){col 67}={col 70}{res}  2395.48
{txt}Log likelihood = {res}-165.77618{col 49}{txt}Prob > chi2{col 67}={col 73}{res}0.0000

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  behavior_problems{col 21}{c |} Coefficient{col 33}  Std. err.{col 45}      z{col 53}   P>|z|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}income {c |}{col 21}{res}{space 2}-.0000898{col 33}{space 2} 6.68e-06{col 44}{space 1}  -13.44{col 53}{space 3}0.000{col 61}{space 4}-.0001029{col 74}{space 3}-.0000767
{txt}physical_punishment {c |}{col 21}{res}{space 2} 10.08122{col 33}{space 2}  .211381{col 44}{space 1}   47.69{col 53}{space 3}0.000{col 61}{space 4} 9.666924{col 74}{space 3} 10.49552
{txt}{space 14}_cons {c |}{col 21}{res}{space 2}  110.447{col 33}{space 2} .9834314{col 44}{space 1}  112.31{col 53}{space 3}0.000{col 61}{space 4} 108.5195{col 74}{space 3} 112.3744
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{hline 29}{c TT}{hline 48}
{col 3}Random-effects parameters{col 30}{c |}{col 34}Estimate{col 45}Std. err.{col 59}[95% conf. interval]
{hline 29}{c +}{hline 48}
{res}country{txt}: Identity{col 30}{c |}
{space 18}var(_cons) {c |}{res}{col 33} 9.711427{col 44} 4.253129{col 58}  4.11622{col 70} 22.91224
{txt}{hline 29}{c +}{hline 48}
{col 16}var(Residual){col 30}{c |}{res}{col 33} .9959301{col 44} .1494585{col 58} .7421465{col 70} 1.336497
{txt}{hline 29}{c BT}{hline 48}
LR test vs. linear model:{col 27}{help j_chibar##|_new:chibar2(01) =} {res}173.94{col 55}{txt}Prob >= chibar2 = {col 73}{res}0.0000
{txt}
{com}. //_15
. display %5.3f 10000 * _b[income]
{res}-0.898
{txt}
{com}. //_16
. display %5.3f _b[physical_punishment]
{res}10.081
{txt}
{com}. //_17
. display %5.3f _b[_cons]
{res}110.447
{txt}
{com}. //_18
. egen m_income = mean(income) // grand mean of income
{txt}
{com}. //_19
. generate c_income = income - m_income // grand mean centered income
{txt}
{com}. //_20
. twoway (scatter behavior_problems c_income if physical_punishment ==0) ///
> (scatter behavior_problems c_income if physical_punishment == 1), ///
> legend(order(1 "no physical punishment" 2 "physical punishment") pos(6)) ///
> title("Behavior Problems by Income and Physical Punishment") ///
> caption("Income is Grand Mean Centered") ///
> xtitle("Per Capita Income") ///
> ytitle("Behavior Problems") ///
> scheme(michigan)
{res}{txt}
{com}. //_21
. graph export myscatter2.png, width(1000) replace
{txt}{p 0 4 2}
file {bf}
myscatter2.png{rm}
saved as
PNG
format
{p_end}

{com}. //_22
. mixed behavior_problems c_income physical_punishment || country:
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-165.77618}  
{res}{txt}Iteration 1:{space 3}log likelihood = {res:-165.77618}  
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects ML regression{col 49}Number of obs{col 67}={col 69}{res}       100
{txt}Group variable: {res}country{col 49}{txt}Number of groups{col 67}={col 69}{res}        11
{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       9.1
{txt}{col 63}max{col 67}={col 69}{res}        10
{col 49}{txt}Wald chi2({res}2{txt}){col 67}={col 70}{res}  2395.48
{txt}Log likelihood = {res}-165.77618{col 49}{txt}Prob > chi2{col 67}={col 73}{res}0.0000

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  behavior_problems{col 21}{c |} Coefficient{col 33}  Std. err.{col 45}      z{col 53}   P>|z|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}c_income {c |}{col 21}{res}{space 2}-.0000898{col 33}{space 2} 6.68e-06{col 44}{space 1}  -13.44{col 53}{space 3}0.000{col 61}{space 4}-.0001029{col 74}{space 3}-.0000767
{txt}physical_punishment {c |}{col 21}{res}{space 2} 10.08122{col 33}{space 2}  .211381{col 44}{space 1}   47.69{col 53}{space 3}0.000{col 61}{space 4} 9.666924{col 74}{space 3} 10.49552
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 107.0459{col 33}{space 2} .9511417{col 44}{space 1}  112.54{col 53}{space 3}0.000{col 61}{space 4} 105.1817{col 74}{space 3} 108.9101
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{hline 29}{c TT}{hline 48}
{col 3}Random-effects parameters{col 30}{c |}{col 34}Estimate{col 45}Std. err.{col 59}[95% conf. interval]
{hline 29}{c +}{hline 48}
{res}country{txt}: Identity{col 30}{c |}
{space 18}var(_cons) {c |}{res}{col 33} 9.711427{col 44} 4.253128{col 58}  4.11622{col 70} 22.91224
{txt}{hline 29}{c +}{hline 48}
{col 16}var(Residual){col 30}{c |}{res}{col 33} .9959301{col 44} .1494585{col 58} .7421465{col 70} 1.336497
{txt}{hline 29}{c BT}{hline 48}
LR test vs. linear model:{col 27}{help j_chibar##|_new:chibar2(01) =} {res}173.94{col 55}{txt}Prob >= chibar2 = {col 73}{res}0.0000
{txt}
{com}. //_23
. bysort country: egen m_g_income = mean(income) // GROUP mean of income
{txt}
{com}. //_24
. generate c_g_income = income - m_g_income // GROUP mean centered income
{txt}
{com}. //_25
. bysort country: egen m_g_physical_punishment = mean(physical_punishment) // GROUP mean of physical punishment
{txt}
{com}. //_26
. generate c_g_physical_punishment = physical_punishment - m_g_physical_punishment // GROUP mean centered physical punishment
{txt}
{com}. //_27
. quietly: mixed behavior_problems income m_g_income physical_punishment m_g_physical_punishment || country:
{txt}
{com}. //_28
. quietly: mixed behavior_problems c_g_physical_punishment m_g_income c_g_physical_punishment m_g_physical_punishment || country:
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\agrogan\Box Sync\Box Sync\GitHub\multilevel\centering-in-cross-sectional-data\centering-in-cross-sectional-data.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}25 May 2021, 14:54:57
{txt}{.-}
{smcl}
{txt}{sf}{ul off}