{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/multilevel/fixed-effects-example/fixed-effects-example.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 7 Oct 2022, 16:38:25
{txt}
{com}. //_1
. display c(current_date)
{res} 7 Oct 2022
{txt}
{com}. //_2
. display c(current_time)
{res}16:38:25
{txt}
{com}. //_3
. clear all
{res}{txt}
{com}. //_4
. use https://www.stata-press.com/data/r16/nlswork, clear
{txt}(National Longitudinal Survey.  Young Women 14-26 years of age in 1968)

{com}. //_5
. describe ln_w grade age race union south

{txt}Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:ln_wage        }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}ln(wage/GNP deflator){p_end}
{p 0 48}{bind:grade          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}current grade completed{p_end}
{p 0 48}{bind:age            }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}age in current year{p_end}
{p 0 48}{bind:race           }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:racelbl  }{bind:  }{res}{res}race{p_end}
{p 0 48}{bind:union          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}1 if union{p_end}
{p 0 48}{bind:south          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}1 if south{p_end}
{txt}
{com}. //_6
. mixed ln_w grade age i.race union south || idcode: 
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 3}log likelihood = {res: -5486.826}  
{res}{txt}Iteration 1:{space 3}log likelihood = {res: -5486.826}  
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects ML regression{col 49}Number of obs{col 67}={col 69}{res}    19,224
{txt}Group variable: {res}idcode{col 49}{txt}Number of groups{col 67}={col 69}{res}     4,148
{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       4.6
{txt}{col 63}max{col 67}={col 69}{res}        12
{col 49}{txt}Wald chi2({res}6{txt}){col 67}={col 70}{res}  3471.83
{txt}Log likelihood = {res} -5486.826{col 49}{txt}Prob > chi2{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     ln_wage{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}grade {c |}{col 14}{res}{space 2} .0781541{col 26}{space 2} .0021992{col 37}{space 1}   35.54{col 46}{space 3}0.000{col 54}{space 4} .0738438{col 67}{space 3} .0824644
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0137491{col 26}{space 2} .0003907{col 37}{space 1}   35.19{col 46}{space 3}0.000{col 54}{space 4} .0129833{col 67}{space 3} .0145149
{txt}{space 12} {c |}
{space 8}race {c |}
{space 6}black  {c |}{col 14}{res}{space 2}-.0405347{col 26}{space 2} .0126091{col 37}{space 1}   -3.21{col 46}{space 3}0.001{col 54}{space 4}-.0652482{col 67}{space 3}-.0158212
{txt}{space 6}other  {c |}{col 14}{res}{space 2} .0404357{col 26}{space 2} .0508123{col 37}{space 1}    0.80{col 46}{space 3}0.426{col 54}{space 4}-.0591545{col 67}{space 3}  .140026
{txt}{space 12} {c |}
{space 7}union {c |}{col 14}{res}{space 2} .1243977{col 26}{space 2} .0065614{col 37}{space 1}   18.96{col 46}{space 3}0.000{col 54}{space 4} .1115375{col 67}{space 3} .1372579
{txt}{space 7}south {c |}{col 14}{res}{space 2}-.1019453{col 26}{space 2} .0090188{col 37}{space 1}  -11.30{col 46}{space 3}0.000{col 54}{space 4}-.1196219{col 67}{space 3}-.0842687
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .3110752{col 26}{space 2} .0314868{col 37}{space 1}    9.88{col 46}{space 3}0.000{col 54}{space 4} .2493622{col 67}{space 3} .3727882
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{hline 29}{c TT}{hline 48}
{col 3}Random-effects parameters{col 30}{c |}{col 34}Estimate{col 45}Std. err.{col 59}[95% conf. interval]
{hline 29}{c +}{hline 48}
{res}idcode{txt}: Identity{col 30}{c |}
{space 18}var(_cons) {c |}{res}{col 33} .0998265{col 44} .0027427{col 58} .0945931{col 70} .1053494
{txt}{hline 29}{c +}{hline 48}
{col 16}var(Residual){col 30}{c |}{res}{col 33} .0691308{col 44} .0007996{col 58} .0675813{col 70} .0707159
{txt}{hline 29}{c BT}{hline 48}
LR test vs. linear model:{col 27}{help j_chibar##|_new:chibar2(01) =} {res}8473.10{col 55}{txt}Prob >= chibar2 = {col 73}{res}0.0000
{txt}
{com}. //_7
. est store MLM
{txt}
{com}. //_8
. xtreg ln_w grade age i.race union south, i(idcode) fe
{txt}{p 0 6 2}note: {bf:grade} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:2.race} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:3.race} omitted because of collinearity.{p_end}
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}    19,224
{txt}Group variable: {res}idcode{txt}{col 49}Number of groups{col 67}={col 69}{res}     4,148

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.0983{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     Between = {res}0.0712{col 63}{txt}avg{col 67}={col 69}{res}       4.6
{txt}     Overall = {res}0.0847{col 63}{txt}max{col 67}={col 69}{res}        12

{txt}{col 49}F({res}3{txt},{res}15073{txt}){col 67}={col 70}{res}   547.57
{txt}corr(u_i, Xb) = {res}0.0599{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     ln_wage{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}grade {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}age {c |}{col 14}{res}{space 2} .0153807{col 26}{space 2} .0004154{col 37}{space 1}   37.03{col 46}{space 3}0.000{col 54}{space 4} .0145665{col 67}{space 3} .0161949
{txt}{space 12} {c |}
{space 8}race {c |}
{space 6}black  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 6}other  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 7}union {c |}{col 14}{res}{space 2} .1034851{col 26}{space 2} .0070913{col 37}{space 1}   14.59{col 46}{space 3}0.000{col 54}{space 4} .0895853{col 67}{space 3} .1173849
{txt}{space 7}south {c |}{col 14}{res}{space 2}-.0759973{col 26}{space 2} .0135167{col 37}{space 1}   -5.62{col 46}{space 3}0.000{col 54}{space 4}-.1024917{col 67}{space 3}-.0495029
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.279453{col 26}{space 2} .0143464{col 37}{space 1}   89.18{col 46}{space 3}0.000{col 54}{space 4} 1.251332{col 67}{space 3} 1.307573
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .41784013
     {txt}sigma_e {c |} {res}  .2618843
         {txt}rho {c |} {res} .71796552{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}4147{txt}, {res}15073{txt}) = {res}9.60{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. //_9
. est store FE
{txt}
{com}. //_10
. est table MLM FE, star equations(1)
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{ralign 12:Variable} {c |} {center 13:MLM} {space 1} {center 13:FE} {space 1}
{hline 12}{c -}{c +}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{res}{txt}{res}#1           {txt}{c |}{res}
{txt}{space 7}grade {c |}{res} {ralign 10:.07815409}{lalign 3:***}{txt} {space 1}{res} {ralign 10:(omitted)}{lalign 3:}{txt} {space 1}
{res}{txt}{space 9}age {c |}{res} {ralign 10:.01374911}{lalign 3:***}{txt} {space 1}{res} {ralign 10:.01538067}{lalign 3:***}{txt} {space 1}
{res}{txt}{space 12} {c |}
{space 8}race {c |}
{space 6}black  {c |}{res} {ralign 10:-.04053471}{lalign 3:**}{txt} {space 1}{res} {ralign 10:(omitted)}{lalign 3:}{txt} {space 1}
{res}{txt}{space 6}other  {c |}{res} {ralign 10:.04043574}{lalign 3:}{txt} {space 1}{res} {ralign 10:(omitted)}{lalign 3:}{txt} {space 1}
{res}{txt}{space 12} {c |}
{space 7}union {c |}{res} {ralign 10:.12439767}{lalign 3:***}{txt} {space 1}{res} {ralign 10:.10348514}{lalign 3:***}{txt} {space 1}
{res}{txt}{space 7}south {c |}{res} {ralign 10:-.10194526}{lalign 3:***}{txt} {space 1}{res} {ralign 10:-.07599732}{lalign 3:***}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:.31107518}{lalign 3:***}{txt} {space 1}{res} {ralign 10:1.2794525}{lalign 3:***}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{res}{txt}{res}lns1_1_1     {txt}{c |}{res}
{txt}{space 7}_cons {c |}{res} {ralign 10:-1.1521609}{lalign 3:***}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{res}{txt}{res}lnsig_e      {txt}{c |}{res}
{txt}{space 7}_cons {c |}{res} {ralign 10:-1.3358773}{lalign 3:***}{txt} {space 1}{res} {ralign 10:}{lalign 3:}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{ralign 46:Legend: * p<0.05; ** p<0.01; *** p<0.001}
{res}{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/multilevel/fixed-effects-example/fixed-effects-example.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 7 Oct 2022, 16:38:36
{txt}{.-}
{smcl}
{txt}{sf}{ul off}