{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\agrogan\Box Sync\Box Sync\GitHub\multilevel\spaghetti-plot\Stata\spaghetti-plot-demo.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 3 Apr 2021, 12:10:56
{txt}
{com}. //_1
. display c(current_date)
{res} 3 Apr 2021
{txt}
{com}. //_2
. use https://stats.idre.ucla.edu/stat/examples/imm/imm23, clear
{txt}
{com}. //_3
. label variable ses "Socioeconomic Status" // correct spelling of variable label
{txt}
{com}. //_4
. spagplot math ses, id(schid) 
{res}{txt}
{com}. //_5
. graph export graph1.png, width(500) replace
{txt}(file graph1.png written in PNG format)

{com}. //_6
. spagplot math ses, id(schid) scheme(s1color) title("Spaghetti Plot of Math Score By SES")
{res}{txt}
{com}. //_7
. graph export graph2.png, width(500) replace
{txt}(file graph2.png written in PNG format)

{com}. //_8
. twoway lfit math ses, scheme(s1color) title("Math Score By SES")
{res}{txt}
{com}. //_9
. graph export graph3.png, width(500) replace
{txt}(file graph3.png written in PNG format)

{com}. //_10
. twoway lfit math ses, scheme(s1color) by(schid, title("Math Score By SES")) 
{res}{txt}
{com}. //_11
. graph export graph4.png, width(1000) replace
{txt}(file graph4.png written in PNG format)

{com}. //_12
. twoway (lfit math ses) ///
> (scatter math ses, mcolor(gs7%30)), /// color gs7 @ 30% transparency
> scheme(s1color) by(schid, title("Math Score By SES"))
{res}{txt}
{com}. //_13
. graph export graph5.png, width(1000) replace
{txt}(file graph5.png written in PNG format)

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\agrogan\Box Sync\Box Sync\GitHub\multilevel\spaghetti-plot\Stata\spaghetti-plot-demo.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 3 Apr 2021, 12:11:17
{txt}{.-}
{smcl}
{txt}{sf}{ul off}