{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/multilevel/mlm-gutten/mlm-gutten.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}17 Feb 2023, 11:34:07
{txt}
{com}. //_1
. display c(current_date)
{res}17 Feb 2023
{txt}
{com}. //_2
. display c(current_time)
{res}11:34:07
{txt}
{com}. //_3
. use gutten.dta, clear
{txt}
{com}. //_4
. egen ageMEAN = mean(age_base)
{txt}
{com}. //_5
. generate ageCENTERED = age_base - ageMEAN
{txt}
{com}. //_6
. spagplot height ageCENTERED, id(tree_ID) scheme(michigan)
{res}{txt}
{com}. //_7
. graph export myspagplot.png, width(500) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/multilevel/mlm-gutten/myspagplot.png{rm}
saved as
PNG
format
{p_end}

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/multilevel/mlm-gutten/mlm-gutten.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}17 Feb 2023, 11:34:10
{txt}{.-}
{smcl}
{txt}{sf}{ul off}