{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\agrogan\Desktop\GitHub\multilevel\mlm-gutten\mlm-gutten.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 6 Sep 2021, 10:45:18
{txt}
{com}. //_1
. display c(current_date)
{res} 6 Sep 2021
{txt}
{com}. //_2
. display c(current_time)
{res}10:45:18
{txt}
{com}. //_3
. use gutten.dta, clear
{txt}
{com}. //_4
. egen ageMEAN = mean(age_base)
{txt}
{com}. //_5
. generate ageCENTERED = age_base - ageMEAN
{txt}
{com}. //_6
. spagplot height ageCENTERED, id(tree_ID) scheme(michigan)
{res}{txt}
{com}. //_7
. graph export myspagplot.png, width(500) replace
{txt}{p 0 4 2}
file {bf}
myspagplot.png{rm}
saved as
PNG
format
{p_end}

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\agrogan\Desktop\GitHub\multilevel\mlm-gutten\mlm-gutten.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 6 Sep 2021, 10:45:19
{txt}{.-}
{smcl}
{txt}{sf}{ul off}