{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/multilevel/visualizing-MLM/visualizing-MLM.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}25 Apr 2023, 11:39:06
{txt}
{com}. //_1
. display c(current_date)
{res}25 Apr 2023
{txt}
{com}. //_2
. display c(current_time)
{res}11:39:06
{txt}
{com}. //_3
. set scheme michigan
{txt}
{com}. //_4
. use "https://github.com/agrogan1/multilevel-thinking/raw/main/simulate-and-analyze-multilevel-data/simulated_multilevel_data.dta", clear
{txt}
{com}. //_5
. twoway scatter outcome warmth
{res}{txt}
{com}. //_6
. graph export myscatter.png, width(1500) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/multilevel/visualizing-MLM/myscatter.png{rm}
saved as
PNG
format
{p_end}

{com}. //_7
. twoway lfit outcome warmth
{res}{txt}
{com}. //_8
. graph export mylinear.png, width(1500) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/multilevel/visualizing-MLM/mylinear.png{rm}
saved as
PNG
format
{p_end}

{com}. //_9
. twoway lfitci outcome warmth
{res}{txt}
{com}. //_10
. graph export mylfitci.png, width(1500) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/multilevel/visualizing-MLM/mylfitci.png{rm}
saved as
PNG
format
{p_end}

{com}. //_11
. twoway (scatter outcome warmth) (lfit outcome warmth)
{res}{txt}
{com}. //_12
. graph export myscatterlinear.png, width(1500) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/multilevel/visualizing-MLM/myscatterlinear.png{rm}
saved as
PNG
format
{p_end}

{com}. //_13
. spagplot outcome warmth, id(country)
{res}{txt}
{com}. //_14
. graph export myspaghetti.png, width(1500) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/multilevel/visualizing-MLM/myspaghetti.png{rm}
saved as
PNG
format
{p_end}

{com}. //_15
. twoway (scatter outcome warmth, mcolor(%30)) (lfit outcome warmth), by(country) aspect(1)
{res}{txt}
{com}. //_16
. graph export mysmallmultiples.png, width(1500) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/multilevel/visualizing-MLM/mysmallmultiples.png{rm}
saved as
PNG
format
{p_end}

{com}. //_17
. set seed 3846 // random seed for reproducibility
{txt}
{com}. //_18
. gen randomid = runiform() // generate a random id variable
{txt}
{com}. //_19
. * by country (i.e. by Level 2 unit) replace the randomid 
. * with the first randomid for that country (Level 2 unit)
. * so that every person in that country has the same random id
. //_20
. bysort country: replace randomid = randomid[1] 
{txt}(2,970 real changes made)

{com}. //_21
. summarize randomid // descriptive statistics for random id

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}randomid {c |}{res}      3,000    .6174022    .2374704   .0733026   .9657055
{txt}
{com}. //_22
. twoway (scatter outcome warmth, mcolor(%30)) /// scatterplot
> (lfit outcome warmth) /// linear fit
> if randomid < .5, /// only use a subset of randomid's
> by(country) aspect(1) // by country
{res}{txt}
{com}. //_23
. graph export mysmallmultiples2.png, width(1500) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/multilevel/visualizing-MLM/mysmallmultiples2.png{rm}
saved as
PNG
format
{p_end}

{com}. //_24
. mixed outcome warmth physical_punishment i.group || country: // estimate MLM
{res}
{txt}Performing EM optimization ...
{res}
{txt}Performing gradient-based optimization: {res}
{txt}Iteration 0:{space 3}log likelihood = {res:-9668.0859}  
Iteration 1:{space 3}log likelihood = {res:-9668.0859}  
{res}
{txt}Computing standard errors ...
{res}
{txt}Mixed-effects ML regression{col 49}Number of obs{col 67}={col 69}{res}     3,000
{txt}Group variable: {res}country{col 49}{txt}Number of groups{col 67}={col 69}{res}        30
{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}       100
{txt}{col 63}avg{col 67}={col 69}{res}     100.0
{txt}{col 63}max{col 67}={col 69}{res}       100
{col 49}{txt}Wald chi2({res}3{txt}){col 67}={col 70}{res}   401.00
{txt}Log likelihood = {res}-9668.0859{col 49}{txt}Prob > chi2{col 67}={col 73}{res}0.0000

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            outcome{col 21}{c |} Coefficient{col 33}  Std. err.{col 45}      z{col 53}   P>|z|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}warmth {c |}{col 21}{res}{space 2}  .961837{col 33}{space 2} .0581809{col 44}{space 1}   16.53{col 53}{space 3}0.000{col 61}{space 4} .8478046{col 74}{space 3} 1.075869
{txt}physical_punishment {c |}{col 21}{res}{space 2}-.8457672{col 33}{space 2} .0798128{col 44}{space 1}  -10.60{col 53}{space 3}0.000{col 61}{space 4}-1.002197{col 74}{space 3}-.6893369
{txt}{space 12}2.group {c |}{col 21}{res}{space 2} 1.084409{col 33}{space 2} .2200548{col 44}{space 1}    4.93{col 53}{space 3}0.000{col 61}{space 4} .6531099{col 74}{space 3} 1.515709
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 51.64797{col 33}{space 2} .4645466{col 44}{space 1}  111.18{col 53}{space 3}0.000{col 61}{space 4} 50.73748{col 74}{space 3} 52.55847
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}{hline 29}{c TT}{hline 48}
{col 3}Random-effects parameters{col 30}{c |}{col 34}Estimate{col 45}Std. err.{col 59}[95% conf. interval]
{hline 29}{c +}{hline 48}
{res}country{txt}: Identity{col 30}{c |}
{space 18}var(_cons) {c |}{res}{col 33}    3.403{col 44} .9717558{col 58} 1.944438{col 70} 5.955659
{txt}{hline 29}{c +}{hline 48}
{col 16}var(Residual){col 30}{c |}{res}{col 33} 36.01911{col 44} .9346952{col 58} 34.23295{col 70} 37.89847
{txt}{hline 29}{c BT}{hline 48}
LR test vs. linear model:{col 27}{help j_chibar##|_new:chibar2(01) =} {res}200.29{col 55}{txt}Prob >= chibar2 = {col 73}{res}0.0000
{txt}
{com}. //_25
. predict outcome_hat, fitted // predict yhat (`fitted` uses fixed AND random effects)
{txt}
{com}. //_26
. twoway (scatter outcome_hat warmth) (lfit outcome_hat warmth)
{res}{txt}
{com}. //_27
. graph export mypredictedvalues.png, width(1500) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/multilevel/visualizing-MLM/mypredictedvalues.png{rm}
saved as
PNG
format
{p_end}

{com}. //_28
. twoway (lfit outcome_hat warmth)
{res}{txt}
{com}. //_29
. graph export mypredictedvalues2.png, width(1500) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/multilevel/visualizing-MLM/mypredictedvalues2.png{rm}
saved as
PNG
format
{p_end}

{com}. //_30
. spagplot outcome_hat warmth, id(country)
{res}{txt}
{com}. //_31
. graph export myspaghetti2.png, width(1500) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/multilevel/visualizing-MLM/myspaghetti2.png{rm}
saved as
PNG
format
{p_end}

{com}. //_32
. mixed outcome warmth physical_punishment i.group || country: // estimate MLM
{res}
{txt}Performing EM optimization ...
{res}
{txt}Performing gradient-based optimization: {res}
{txt}Iteration 0:{space 3}log likelihood = {res:-9668.0859}  
Iteration 1:{space 3}log likelihood = {res:-9668.0859}  
{res}
{txt}Computing standard errors ...
{res}
{txt}Mixed-effects ML regression{col 49}Number of obs{col 67}={col 69}{res}     3,000
{txt}Group variable: {res}country{col 49}{txt}Number of groups{col 67}={col 69}{res}        30
{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}       100
{txt}{col 63}avg{col 67}={col 69}{res}     100.0
{txt}{col 63}max{col 67}={col 69}{res}       100
{col 49}{txt}Wald chi2({res}3{txt}){col 67}={col 70}{res}   401.00
{txt}Log likelihood = {res}-9668.0859{col 49}{txt}Prob > chi2{col 67}={col 73}{res}0.0000

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            outcome{col 21}{c |} Coefficient{col 33}  Std. err.{col 45}      z{col 53}   P>|z|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}warmth {c |}{col 21}{res}{space 2}  .961837{col 33}{space 2} .0581809{col 44}{space 1}   16.53{col 53}{space 3}0.000{col 61}{space 4} .8478046{col 74}{space 3} 1.075869
{txt}physical_punishment {c |}{col 21}{res}{space 2}-.8457672{col 33}{space 2} .0798128{col 44}{space 1}  -10.60{col 53}{space 3}0.000{col 61}{space 4}-1.002197{col 74}{space 3}-.6893369
{txt}{space 12}2.group {c |}{col 21}{res}{space 2} 1.084409{col 33}{space 2} .2200548{col 44}{space 1}    4.93{col 53}{space 3}0.000{col 61}{space 4} .6531099{col 74}{space 3} 1.515709
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 51.64797{col 33}{space 2} .4645466{col 44}{space 1}  111.18{col 53}{space 3}0.000{col 61}{space 4} 50.73748{col 74}{space 3} 52.55847
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}{hline 29}{c TT}{hline 48}
{col 3}Random-effects parameters{col 30}{c |}{col 34}Estimate{col 45}Std. err.{col 59}[95% conf. interval]
{hline 29}{c +}{hline 48}
{res}country{txt}: Identity{col 30}{c |}
{space 18}var(_cons) {c |}{res}{col 33}    3.403{col 44} .9717558{col 58} 1.944438{col 70} 5.955659
{txt}{hline 29}{c +}{hline 48}
{col 16}var(Residual){col 30}{c |}{res}{col 33} 36.01911{col 44} .9346952{col 58} 34.23295{col 70} 37.89847
{txt}{hline 29}{c BT}{hline 48}
LR test vs. linear model:{col 27}{help j_chibar##|_new:chibar2(01) =} {res}200.29{col 55}{txt}Prob >= chibar2 = {col 73}{res}0.0000
{txt}
{com}. //_33
. margins group, at(warmth = (1 2 3 4 5 6 7)) // predictive *margins*
{res}
{txt}{col 1}Predictive margins{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:3,000}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Linear prediction, fixed portion, predict()}{p_end}
{p2colreset}{...}
{lalign 7:1._at: }{space 0}{lalign 6:warmth} = {res:{ralign 1:1}}
{lalign 7:2._at: }{space 0}{lalign 6:warmth} = {res:{ralign 1:2}}
{lalign 7:3._at: }{space 0}{lalign 6:warmth} = {res:{ralign 1:3}}
{lalign 7:4._at: }{space 0}{lalign 6:warmth} = {res:{ralign 1:4}}
{lalign 7:5._at: }{space 0}{lalign 6:warmth} = {res:{ralign 1:5}}
{lalign 7:6._at: }{space 0}{lalign 6:warmth} = {res:{ralign 1:6}}
{lalign 7:7._at: }{space 0}{lalign 6:warmth} = {res:{ralign 1:7}}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}_at#group {c |}
{space 8}1 1  {c |}{col 14}{res}{space 2}  50.4999{col 26}{space 2} .3983539{col 37}{space 1}  126.77{col 46}{space 3}0.000{col 54}{space 4} 49.71914{col 67}{space 3} 51.28066
{txt}{space 8}1 2  {c |}{col 14}{res}{space 2} 51.58431{col 26}{space 2} .3994365{col 37}{space 1}  129.14{col 46}{space 3}0.000{col 54}{space 4} 50.80143{col 67}{space 3} 52.36719
{txt}{space 8}2 1  {c |}{col 14}{res}{space 2} 51.46174{col 26}{space 2} .3809288{col 37}{space 1}  135.10{col 46}{space 3}0.000{col 54}{space 4} 50.71513{col 67}{space 3} 52.20834
{txt}{space 8}2 2  {c |}{col 14}{res}{space 2} 52.54615{col 26}{space 2}   .38173{col 37}{space 1}  137.65{col 46}{space 3}0.000{col 54}{space 4} 51.79797{col 67}{space 3} 53.29432
{txt}{space 8}3 1  {c |}{col 14}{res}{space 2} 52.42357{col 26}{space 2}  .371884{col 37}{space 1}  140.97{col 46}{space 3}0.000{col 54}{space 4}  51.6947{col 67}{space 3} 53.15245
{txt}{space 8}3 2  {c |}{col 14}{res}{space 2} 53.50798{col 26}{space 2} .3723656{col 37}{space 1}  143.70{col 46}{space 3}0.000{col 54}{space 4} 52.77816{col 67}{space 3} 54.23781
{txt}{space 8}4 1  {c |}{col 14}{res}{space 2} 53.38541{col 26}{space 2} .3718315{col 37}{space 1}  143.57{col 46}{space 3}0.000{col 54}{space 4} 52.65664{col 67}{space 3} 54.11419
{txt}{space 8}4 2  {c |}{col 14}{res}{space 2} 54.46982{col 26}{space 2} .3719738{col 37}{space 1}  146.43{col 46}{space 3}0.000{col 54}{space 4} 53.74077{col 67}{space 3} 55.19888
{txt}{space 8}5 1  {c |}{col 14}{res}{space 2} 54.34725{col 26}{space 2} .3807751{col 37}{space 1}  142.73{col 46}{space 3}0.000{col 54}{space 4} 53.60094{col 67}{space 3} 55.09355
{txt}{space 8}5 2  {c |}{col 14}{res}{space 2} 55.43166{col 26}{space 2} .3805823{col 37}{space 1}  145.65{col 46}{space 3}0.000{col 54}{space 4} 54.68573{col 67}{space 3} 56.17759
{txt}{space 8}6 1  {c |}{col 14}{res}{space 2} 55.30909{col 26}{space 2}  .398109{col 37}{space 1}  138.93{col 46}{space 3}0.000{col 54}{space 4} 54.52881{col 67}{space 3} 56.08937
{txt}{space 8}6 2  {c |}{col 14}{res}{space 2}  56.3935{col 26}{space 2}  .397607{col 37}{space 1}  141.83{col 46}{space 3}0.000{col 54}{space 4}  55.6142{col 67}{space 3} 57.17279
{txt}{space 8}7 1  {c |}{col 14}{res}{space 2} 56.27092{col 26}{space 2} .4228024{col 37}{space 1}  133.09{col 46}{space 3}0.000{col 54}{space 4} 55.44225{col 67}{space 3}  57.0996
{txt}{space 8}7 2  {c |}{col 14}{res}{space 2} 57.35533{col 26}{space 2} .4220306{col 37}{space 1}  135.90{col 46}{space 3}0.000{col 54}{space 4} 56.52817{col 67}{space 3}  58.1825
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_34
. marginsplot // plot of predicted values
{res}
{text}{p 0 0 2}Variables that uniquely identify margins: {bf:warmth group}{p_end}
{res}{txt}
{com}. //_35
. graph export mymarginsplot.png, width(1500) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/multilevel/visualizing-MLM/mymarginsplot.png{rm}
saved as
PNG
format
{p_end}

{com}. //_36
. kdensity warmth, generate(warmth_x warmth_d) n(8) // manually generate outcome densities
{res}{txt}
{com}. //_37
. kdensity outcome, generate(outcome_y outcome_d) // manually generate outcome densities
{res}{txt}
{com}. //_38
. replace warmth_d = 100 * warmth_d // rescale the density so it plots well
{txt}(8 real changes made)

{com}. //_39
. replace outcome_d = -10 * outcome_d - .5 // rescale AND FLIP AND MOVE the density so it plots well
{txt}(50 real changes made)

{com}. //_40
. label variable outcome_y "density: beneficial outcome" // relabel y variable
{txt}
{com}. //_41
. twoway (scatter outcome warmth, mcolor(%10)) /// scatterplot w some transparency
> (lfit outcome warmth) /// linear fit
> (line warmth_d warmth_x) /// line plot of x density 
> (line outcome_y outcome_d), /// line plot of y density (note flipped order)
> title("Outcome by Warmth") /// title
> ytitle("beneficial outcome") /// manual ytitle
> xtitle("parental warmth") /// manual xtitle
> legend(position(6) rows(2) ) /// legend at bottom; 2 rows
> xlabel(0 1 2 3 4 5 6 7) /// manual x labels
> name(mynewscatter, replace)
{res}{txt}
{com}. //_42
. graph export mynewscatter.png, width(1500) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/multilevel/visualizing-MLM/mynewscatter.png{rm}
saved as
PNG
format
{p_end}

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/multilevel/visualizing-MLM/visualizing-MLM.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}25 Apr 2023, 11:40:11
{txt}{.-}
{smcl}
{txt}{sf}{ul off}